smoke_tests/stressTests.yml
config:
  target: https://api-stage.wellcomecollection.org
  phases:
    - duration: 10
      arrivalRate: 4
    - duration: 30
      arrivalRate: 2
      rampTo: 8
    - duration: 10
      arrivalRate: 10
  environments:
    prod:
      target: https://api.wellcomecollection.org
      phases:
        - duration: 10
          arrivalRate: 4
        - duration: 30
          arrivalRate: 2
          rampTo: 8
        - duration: 10
          arrivalRate: 10
    stage:
      target: https://api-stage.wellcomecollection.org
      phases:
        - duration: 10
          arrivalRate: 4
        - duration: 30
          arrivalRate: 2
          rampTo: 8
        - duration: 10
          arrivalRate: 10
  payload:
    -
      path: "ids.csv"
      fields:
        - "id"
    -
      path: "queries.csv"
      fields:
        - "query"

scenarios:
  - name: "Normal usage"
    flow:
      - get:
          url: "/catalogue/v2/works?query={{ query }}&includes=identifiers,production,contributors,subjects,partOf&aggregations=workType,availabilities,genres.label,languages,subjects.label,contributors.agent.label"
      - think: 0.5
      - get:
          url: "/catalogue/v2/works/{{ id }}?includes=identifiers,images,items,subjects,genres,contributors,production,notes,parts,partOf,precededBy,succeededBy,languages,holdings"